Autodesk.Revit.DB.MEPAnalyticalConnectionType.FindTypeByName(Autodesk.Revit.DB.Document,System.String)
Finds the analytical connection type by its name.
doc:
The document where the analytical conneciton type is expected.
name:
The name of the expected analytical connection type.
Returns:
The element id of matched analytical connection type, otherwise invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType.GetAllTypes(Autodesk.Revit.DB.Document)
Gets all the analytical connection types.
Remarks:
We suggest you use the generic mechanism Autodesk::Revit::DB::FilteredElementCollector.
doc:
The document where the analytical connection types come from.
Returns:
All the types in this document, empty if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType.IsNameUnused(Autodesk.Revit.DB.Document,System.String)
Checks if this is an unused name.
doc:
The document.
name:
The name to be verified.
Returns:
True if not used by an existing analytical connection type in this document, false if used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType.Create(Autodesk.Revit.DB.Document,System.String)
Creates an analytical connection type element.
Remarks:
The newly created type would have the default pressure loss being 0.
Use ElementType.duplicate to copy from any existing type.
doc:
The document.
name:
The name of the analytical type to be created.
Returns:
The created analytical connection type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This name is already used by an existing analytical connection type in the document.
-or-
name cannot include prohibited characters.
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType.PressureLoss
The pressure loss of this analytical connection type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for pressureLoss must be non-negative.
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType
Represents an analytical connection type between mechanical equipment and piping network.
Since:
2018